
## Plan Result




<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.hmc-servicebus-connection-string
  * azurerm_key_vault_secret.sscs-hmc-servicebus-hared-access-key


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.hmc-servicebus-connection-string will be created
  + resource "azurerm_key_vault_secret" "hmc-servicebus-connection-string" {
      + id             = (known after apply)
      + key_vault_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.KeyVault/vaults/sscs-aat"
      + name           = "hmc-servicebus-connection-string"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_key_vault_secret.sscs-hmc-servicebus-hared-access-key will be created
  + resource "azurerm_key_vault_secret" "sscs-hmc-servicebus-hared-access-key" {
      + id             = (known after apply)
      + key_vault_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.KeyVault/vaults/sscs-aat"
      + name           = "hmc-servicebus-shared-access-key"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # azurerm_key_vault_secret.hmc-servicebus-connection-string has been deleted
  - resource "azurerm_key_vault_secret" "hmc-servicebus-connection-string" {
      - id             = "https://sscs-aat.vault.azure.net/secrets/hmc-servicebus-connection-string/9fe13c80046746c79aa33ff5eb3555cc" -> null
      - key_vault_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.KeyVault/vaults/sscs-aat" -> null
      - name           = "hmc-servicebus-connection-string" -> null
      - tags           = {} -> null
      - value          = (sensitive value)
      - version        = "a0a11c31af4c4b78afe588887333dfcc" -> null
      - versionless_id = "https://sscs-aat.vault.azure.net/secrets/hmc-servicebus-connection-string" -> null
    }
  # azurerm_key_vault_secret.shared_access_key["hmc-servicebus-connection-string"] has been deleted
  - resource "azurerm_key_vault_secret" "shared_access_key" {
      - content_type   = "" -> null
      - id             = "https://sscs-aat.vault.azure.net/secrets/hmc-servicebus-connection-string/a0a11c31af4c4b78afe588887333dfcc" -> null
      - key_vault_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.KeyVault/vaults/sscs-aat" -> null
      - name           = "hmc-servicebus-connection-string" -> null
      - tags           = {} -> null
      - value          = (sensitive value)
      - version        = "a0a11c31af4c4b78afe588887333dfcc" -> null
      - versionless_id = "https://sscs-aat.vault.azure.net/secrets/hmc-servicebus-connection-string" -> null
    }
  # azurerm_key_vault_secret.shared_access_key["hmc-servicebus-shared-access-key"] has been deleted
  - resource "azurerm_key_vault_secret" "shared_access_key" {
      - content_type   = "" -> null
      - id             = "https://sscs-aat.vault.azure.net/secrets/hmc-servicebus-shared-access-key/c9cf1514aa42408f833338ae34998c93" -> null
      - key_vault_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.KeyVault/vaults/sscs-aat" -> null
      - name           = "hmc-servicebus-shared-access-key" -> null
      - tags           = {} -> null
      - value          = (sensitive value)
      - version        = "c9cf1514aa42408f833338ae34998c93" -> null
      - versionless_id = "https://sscs-aat.vault.azure.net/secrets/hmc-servicebus-shared-access-key" -> null
    }
  # azurerm_key_vault_secret.sscs-hmc-servicebus-hared-access-key has been deleted
  - resource "azurerm_key_vault_secret" "sscs-hmc-servicebus-hared-access-key" {
      - id             = "https://sscs-aat.vault.azure.net/secrets/hmc-servicebus-shared-access-key/f3327b3a85e448598e2d02530aacd51b" -> null
      - key_vault_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.KeyVault/vaults/sscs-aat" -> null
      - name           = "hmc-servicebus-shared-access-key" -> null
      - tags           = {} -> null
      - value          = (sensitive value)
      - version        = "c9cf1514aa42408f833338ae34998c93" -> null
      - versionless_id = "https://sscs-aat.vault.azure.net/secrets/hmc-servicebus-shared-access-key" -> null
    }

Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":363,"Program":"tfcmt","SHA1":"","Vars":{}} -->